Revit 2027 API
FabricationSaveJobOptions Properties
The FabricationSaveJobOptions type exposes the following members.
Properties
Name | Description
AddHolesForTaps |  Set true to have holes for taps on straights added to the created fabrication job.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
FabricationSaveJobOptions Class
Autodesk.Revit.DB.Fabrication Namespace